<img src='../Data/sakila-db-model.png'>

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

# ## Change username and password to match your personal MySQL Server settings
# username = 'root' # default username for MySQL db is root
# password = 'YOUR_PASSWORD' # whatever password you chose during MySQL installation.

# connection = f'mysql+pymysql://{username}:{password}@localhost/sakila'
# engine = create_engine(connection)

In [2]:
import json
with open('/Users/sherlin01/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/sakila"
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Show the Tables

In [5]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

## 1. What is the average length of films by category?

In [6]:
q = '''SELECT category.name, AVG(length)
FROM film 
JOIN film_category 
ON film.film_id = film_category.film_id 
JOIN category 
ON film_category.category_id = category.category_id
GROUP BY category.name
ORDER BY AVG(length) DESC;'''

pd.read_sql(q, engine)

           name  AVG(length)
0        Sports     128.2027
1         Games     127.8361
2       Foreign     121.6986
3         Drama     120.8387
4        Comedy     115.8276
5        Family     114.7826
6         Music     113.6471
7        Travel     113.3158
8        Horror     112.4821
9      Classics     111.6667
10       Action     111.6094
11          New     111.1270
12    Animation     111.0152
13     Children     109.8000
14  Documentary     108.7500
15       Sci-Fi     108.1967

## 2. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

In [7]:
q = '''SELECT f.title AS 'Movie Title'
FROM film AS f
JOIN film_category AS fc
ON f.film_id = fc.film_id
JOIN category AS c 
ON fc.category_id = c.category_id
WHERE c.name = "Family";'''

pd.read_sql(q, engine)

         Movie Title
0        AFRICAN EGG
1      APACHE DIVINE
2     ATLANTIS CAUSE
3    BAKED CLEOPATRA
4          BANG KWAI
..               ...
64       SPLASH GUMP
65      SUNSET RACER
66     SUPER WYOMING
67  VIRTUAL SPOILERS
68      WILLOW TRACY

[69 rows x 1 columns]

## 3 You want to run an email marketing campaign in Canada, for which you will need the names and email addresses of all Canadian customers. Use joins to retrieve this information.

In [8]:
q = '''SELECT c.first_name, c.last_name, c.email 
FROM customer AS c
JOIN address AS a 
ON c.address_id = a.address_id
JOIN city AS cy 
ON a.city_id = cy.city_id
JOIN country AS ct 
ON cy.country_id = ct.country_id
where ct.country = "Canada";'''

pd.read_sql(q, engine)

  first_name  last_name                                 email
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org

# The following queries use subqueries

## 4. Find the customer's first and last name where the amount paid was greater than the average payment. Make sure to only show unique results.

In [9]:
q = '''SELECT DISTINCT customer.first_name, customer.last_name, payment.amount
FROM customer
JOIN payment
ON customer.customer_id = payment.customer_id
WHERE payment.amount > (SELECT AVG(payment.amount) FROM payment);'''

pd.read_sql(q, engine)

     first_name last_name  amount
0          MARY     SMITH    5.99
1          MARY     SMITH    9.99
2          MARY     SMITH    4.99
3          MARY     SMITH    7.99
4      PATRICIA   JOHNSON    4.99
...         ...       ...     ...
2691       WADE  DELVALLE    7.99
2692     AUSTIN   CINTRON    4.99
2693     AUSTIN   CINTRON    6.99
2694     AUSTIN   CINTRON    9.99
2695     AUSTIN   CINTRON    8.99

[2696 rows x 3 columns]

## 5. Find the total number of payments made by Mary Smith using subqueries.

In [10]:
q = '''SELECT COUNT(*) AS "Num Payments"
FROM (SELECT payment_id
FROM payment
WHERE customer_id = (SELECT customer_id
                        FROM customer
                        WHERE first_name = 'Mary' AND last_name = "Smith")) AS payment_id'''

pd.read_sql(q, engine)

   Num Payments
0            32

## 6. Use subqueries to display all actors who appear in the film Alone Trip.

In [11]:
q = '''SELECT first_name, last_name 
FROM actor
WHERE actor_id IN (SELECT actor_id
                	FROM film_actor
                	WHERE film_id in (SELECT film_id 
                                        FROM film 
                                        WHERE title = "ALONE TRIP"));'''

pd.read_sql(q, engine)

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

<img src = '../Data/Challenge.jpg'>

## 1. What are the titles, categories, and lengths of all films in the Sakila database that are longer than 120 minutes? Put the films in order by length.

In [12]:
q = '''SELECT f.title, c.name, f.length
FROM film AS f
JOIN film_category AS fc
ON f.film_id = fc.film_id
JOIN category AS c
ON fc.category_id = c.category_id
WHERE f.length > 120
ORDER BY f.length;'''

pd.read_sql(q, engine)

                  title       name  length
0          ARIZONA BANG   Classics     121
1         BOOGIE AMELIE      Music     121
2     BRANNIGAN SUNRISE        New     121
3      DANGEROUS UPTOWN    Foreign     121
4           HARRY IDAHO      Drama     121
..                  ...        ...     ...
452       MUSCLE BRIGHT     Travel     185
453        POND SEATTLE  Animation     185
454  SOLDIERS EVOLUTION     Sci-Fi     185
455   SWEET BROTHERHOOD     Travel     185
456        WORST BANGER     Action     185

[457 rows x 3 columns]

## 2. What are the first names, last names, and film titles of all actors named 'Penelope' in the Sakila database?

In [13]:
q = '''SELECT a.first_name, a.last_name, f.title
FROM actor AS a
JOIN film_actor AS fa
ON a.actor_id = fa.actor_id
JOIN film AS f
ON fa.film_id = f.film_id
WHERE a.first_name = 'PENELOPE';'''

pd.read_sql(q, engine)

    first_name last_name                  title
0     PENELOPE   GUINESS       ACADEMY DINOSAUR
1     PENELOPE   GUINESS   ANACONDA CONFESSIONS
2     PENELOPE   GUINESS            ANGELS LIFE
3     PENELOPE   GUINESS  BULWORTH COMMANDMENTS
4     PENELOPE   GUINESS          CHEAPER CLYDE
..         ...       ...                    ...
97    PENELOPE    MONROE     SPIRIT FLINTSTONES
98    PENELOPE    MONROE  TOMATOES HELLFIGHTERS
99    PENELOPE    MONROE        TOURIST PELICAN
100   PENELOPE    MONROE            TRIP NEWTON
101   PENELOPE    MONROE          WYOMING STORM

[102 rows x 3 columns]

# The following queries must use Subqueries for the statement.

## 3. Who are the actors that have acted in the film with film_id = 1

In [14]:
q = '''SELECT *
FROM actor
WHERE actor_id IN (SELECT actor_id FROM film_actor WHERE film_id = 1);'''

pd.read_sql(q, engine)

   actor_id first_name last_name         last_update
0         1   PENELOPE   GUINESS 2006-02-14 12:34:33
1        10  CHRISTIAN     GABLE 2006-02-14 12:34:33
2        20    LUCILLE     TRACY 2006-02-14 12:34:33
3        30     SANDRA      PECK 2006-02-14 12:34:33
4        40     JOHNNY      CAGE 2006-02-14 12:34:33
5        53       MENA    TEMPLE 2006-02-14 12:34:33
6       108     WARREN     NOLTE 2006-02-14 12:34:33
7       162      OPRAH    KILMER 2006-02-14 12:34:33
8       188       ROCK   DUKAKIS 2006-02-14 12:34:33
9       198       MARY    KEITEL 2006-02-14 12:34:33

## 4. What are the films that are in the English Language

In [15]:
q = '''SELECT *
FROM film
WHERE language_id = (SELECT language_id FROM language WHERE name = "English");'''

pd.read_sql(q, engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-14 13:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-14 13:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-14 13:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-14 13:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,Deleted Scenes,2006-02-14 13:03:42
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,None,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2006-02-14 13:03:42
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,None,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2006-02-14 13:03:42
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,None,6,0.99,105,10.99,NC-17,Deleted Scenes,2006-02-14 13:03:42
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,None,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2006-02-14 13:03:42
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2006-02-14 13:03:42

## 5. Who are the customers that belong to the store managed by Mike Hillyer?

In [16]:
q = '''SELECT * FROM customer
WHERE store_id = (SELECT store.store_id 
					FROM store 
                    JOIN staff 
                    ON store.store_id = staff.store_id 
                    WHERE staff.last_name = "Hillyer");'''

pd.read_sql(q, engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-14 12:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-14 12:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-14 12:57:20
3,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-14 12:57:20
4,7,1,MARIA,MILLER,MARIA.MILLER@sakilacustomer.org,11,1,2006-02-14 22:04:36,2006-02-14 12:57:20
...,...,...,...,...,...,...,...,...,...
321,594,1,EDUARDO,HIATT,EDUARDO.HIATT@sakilacustomer.org,600,1,2006-02-14 22:04:37,2006-02-14 12:57:20
322,595,1,TERRENCE,GUNDERSON,TERRENCE.GUNDERSON@sakilacustomer.org,601,1,2006-02-14 22:04:37,2006-02-14 12:57:20
323,596,1,ENRIQUE,FORSYTHE,ENRIQUE.FORSYTHE@sakilacustomer.org,602,1,2006-02-14 22:04:37,2006-02-14 12:57:20
324,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,1,2006-02-14 22:04:37,2006-02-14 12:57:20
325,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,1,2006-02-14 22:04:37,2006-02-14 12:57:20